Masmiseim36/nxpSDK/devices/MKE04Z1284/drivers/fsl_flash.c
    /* preparing passing parameter to erase all flash & EEPROM blocks */
    FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

    /* Write index to specify the command code to be loaded */
    flash_set_command(0UL, 0UL, FTMRx_ERASE_ALL_BLOCK);

    /* Validate the user key */
    returnCode = flash_check_user_key(key);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }

    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    /* calling flash command sequence function to execute the command */
    returnCode = flash_command_sequence(config);

    flash_cache_clear(config);

    return returnCode;
}

/*!
 * brief Erases the flash sectors encompassed by parameters passed into
 * function.
 *
 * This function erases the appropriate number of flash sectors based on the
 * desired start address and length.
 *
 * param config The pointer to the storage for the driver runtime state.
 * param start The start address of the desired flash memory to be erased.
 *              The start address does not need to be sector-aligned but must be
 * word-aligned.
 * param lengthInBytes The length, given in bytes (not words or long-words)
 *                      to be erased. Must be word-aligned.
 * param key The value used to validate all flash erase APIs.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_AlignmentError The parameter is not aligned with the
 * specified baseline.
 * retval #kStatus_FLASH_AddressError The address is out of range.
 * retval #kStatus_FLASH_EraseKeyError The API erase key is invalid.
 * retval #kStatus_FLASH_ExecuteInRamFunctionNotReady Execute-in-RAM function is
 * not available.
 * retval #kStatus_FLASH_AccessError Invalid instruction codes and out-of bounds
 * addresses.
 * retval #kStatus_FLASH_ProtectionViolation The program/erase operation is
 * requested to execute on protected areas.
 * retval #kStatus_FLASH_CommandFailure Run-time error during the command
 * execution.
 */
status_t FLASH_Erase(flash_config_t *config, uint32_t start, uint32_t lengthInBytes, uint32_t key)
{
    uint32_t sectorSize;
    flash_operation_config_t flashOperationInfo;
    uint32_t endAddress;      /* storing end address */
    uint32_t numberOfSectors; /* number of sectors calculated by endAddress */
    status_t returnCode;

    returnCode = flash_get_matched_operation_info(config, start, &flashOperationInfo);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }

    /* Check the supplied address range. */
    returnCode = flash_check_range(config, start, lengthInBytes, flashOperationInfo.sectorCmdAddressAligment);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }
    /* Validate the user key */
    returnCode = flash_check_user_key(key);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }

    start      = flashOperationInfo.convertedAddress;
    sectorSize = flashOperationInfo.activeSectorSize;

    /* calculating Flash end address */
    endAddress = start + lengthInBytes - 1U;

    /* re-calculate the endAddress and align it to the start of the next sector
     * which will be used in the comparison below */
    if (0U != (endAddress % sectorSize))
    {
        numberOfSectors = (endAddress / sectorSize) + 1UL;
        endAddress      = (numberOfSectors * sectorSize) - 1UL;
    }

    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    /* the start address will increment to the next sector address
     * until it reaches the endAdddress */
    while (start <= endAddress)
    {
        /* clear error flags */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;
        /* preparing passing parameter to erase a flash block */
        /* Write index to specify the command code to be loaded */
        flash_set_command(0UL, start >> 16UL, FTMRx_ERASE_SECTOR);

        /* Write index to specify the lower byte memory address bits[15:0] to be
         * loaded */
        flash_set_command(1UL, start, start >> 8UL);

        /* calling flash command sequence function to execute the command */
        returnCode = flash_command_sequence(config);

        /* calling flash callback function if it is available */
        if ((config->PFlashCallback) != NULL)
        {
            config->PFlashCallback();
        }

        /* checking the success of command execution */
        if (kStatus_FLASH_Success != returnCode)
        {
            break;
        }
        /* Increment to the next sector */
        start += sectorSize;
    }

    flash_cache_clear(config);

    return (returnCode);
}

/*!
 * brief Erases the eeprom sectors encompassed by parameters passed into
 * function.
 *
 * This function erases the appropriate number of eeprom sectors based on the
 * desired start address and length.
 *
 * param config The pointer to the storage for the driver runtime state.
 * param start The start address of the desired eeprom memory to be erased.
 *              The start address does not need to be sector-aligned but must be
 * word-aligned.
 * param lengthInBytes The length, given in bytes (not words or long-words)
 *                      to be erased. Must be word-aligned.
 * param key The value used to validate all eeprom erase APIs.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_AlignmentError The parameter is not aligned with the
 * specified baseline.
 * retval #kStatus_FLASH_AddressError The address is out of range.
 * retval #kStatus_FLASH_EraseKeyError The API erase key is invalid.
 * retval #kStatus_FLASH_ExecuteInRamFunctionNotReady Execute-in-RAM function is
 * not available.
 * retval #kStatus_FLASH_AccessError Invalid instruction codes and out-of bounds
 * addresses.
 * retval #kStatus_FLASH_ProtectionViolation The program/erase operation is
 * requested to execute on protected areas.
 * retval #kStatus_FLASH_CommandFailure Run-time error during the command
 * execution.
 */
#if FLASH_SSD_IS_EEPROM_ENABLED
status_t FLASH_EraseEEprom(flash_config_t *config, uint32_t start, uint32_t lengthInBytes, uint32_t key)
{
    uint32_t sectorSize;
    flash_operation_config_t flashOperationInfo;
    uint32_t endAddress;      /* storing end address */
    uint32_t numberOfSectors; /* number of sectors calculated by endAddress */
    status_t returnCode;

    returnCode = flash_get_matched_operation_info(config, start, &flashOperationInfo);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }
    /* Check the supplied address range. */
    returnCode = EEPROM_check_range(config, start, lengthInBytes, config->EEpromSectorSize);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }
    /* Validate the user key */
    returnCode = flash_check_user_key(key);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }

    sectorSize = config->EEpromSectorSize;

    /* calculating Flash end address */
    endAddress = start + lengthInBytes - 1UL;

    /* re-calculate the endAddress and align it to the start of the next sector
     * which will be used in the comparison below */
    if (endAddress % sectorSize)
    {
        numberOfSectors = (endAddress / sectorSize) + 1UL;
        endAddress      = (numberOfSectors * sectorSize) - 1UL;
    }

