Masmiseim36/nxpSDK/devices/MKE04Z1284/drivers/fsl_flash.c
    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    /* the start address will increment to the next sector address
     * until it reaches the endAdddress */
    while (start <= endAddress)
    {
        /* clear error flags */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;
        /* preparing passing parameter to erase a flash block */
        /* Write index to specify the command code to be loaded */
        flash_set_command(0UL, start >> 16UL, FTMRx_ERASE_EEPROM_SECTOR);

        /* Write index to specify the lower byte memory address bits[15:0] to be
         * loaded */
        flash_set_command(1UL, start, start >> 8UL);

        /* calling flash command sequence function to execute the command */
        returnCode = flash_command_sequence(config);

        /* calling flash callback function if it is available */
        if (config->PFlashCallback)
        {
            config->PFlashCallback();
        }

        /* checking the success of command execution */
        if (kStatus_FLASH_Success != returnCode)
        {
            break;
        }
        /* Increment to the next sector */
        start += sectorSize;
    }

    flash_cache_clear(config);

    return (returnCode);
}
#endif /* FLASH_SSD_IS_EEPROM_ENABLED */

#if defined(FSL_FEATURE_FLASH_HAS_UNSECURE_FLASH_CMD) && FSL_FEATURE_FLASH_HAS_UNSECURE_FLASH_CMD
status_t FLASH_EraseAllUnsecure(flash_config_t *config, uint32_t key)
{
    status_t returnCode;

    if (config == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }

    /* Prepare passing parameter to erase all flash blocks (unsecure). */
    /* clear error flags */
    FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

    /* Write index to specify the command code to be loaded */
    flash_set_command(0UL, 0UL, FTMRx_ERASE_ALL_BLOCK_UNSECURE);

    /* Validate the user key */
    returnCode = flash_check_user_key(key);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }

    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    /* calling flash command sequence function to execute the command */
    returnCode = flash_command_sequence(config);

    flash_cache_clear(config);

    return returnCode;
}
#endif /* FSL_FEATURE_FLASH_HAS_UNSECURE_FLASH_CMD */

/*!
 * brief Programs flash with data at locations passed in through parameters.
 *
 * This function programs the flash memory with the desired data for a given
 * flash area as determined by the start address and the length.
 *
 * param config A pointer to the storage for the driver runtime state.
 * param start The start address of the desired flash memory to be programmed.
 * Must be
 *              word-aligned.
 * param src A pointer to the source buffer of data that is to be programmed
 *            into the flash.
 * param lengthInBytes The length, given in bytes (not words or long-words),
 *                      to be programmed. Must be word-aligned.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_AlignmentError Parameter is not aligned with the
 * specified baseline.
 * retval #kStatus_FLASH_AddressError Address is out of range.
 * retval #kStatus_FLASH_ExecuteInRamFunctionNotReady Execute-in-RAM function is
 * not available.
 * retval #kStatus_FLASH_AccessError Invalid instruction codes and out-of bounds
 * addresses.
 * retval #kStatus_FLASH_ProtectionViolation The program/erase operation is
 * requested to execute on protected areas.
 * retval #kStatus_FLASH_CommandFailure Run-time error during the command
 * execution.
 */
status_t FLASH_Program(flash_config_t *config, uint32_t start, uint32_t *src, uint32_t lengthInBytes)
{
    status_t returnCode;
    flash_operation_config_t flashOperationInfo;

    if (src == NULL)
    {
        return kStatus_FLASH_InvalidArgument;
    }

    returnCode = flash_get_matched_operation_info(config, start, &flashOperationInfo);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }

    /* Check the supplied address range. */
    returnCode = flash_check_range(config, start, lengthInBytes, flashOperationInfo.blockWriteUnitSize);
    if (returnCode != kStatus_FLASH_Success)
    {
        return returnCode;
    }

    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    while (lengthInBytes > 0UL)
    {
        /* pass paramters to FTMRx */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

        /* Write index to specify the command code to be loaded */
        flash_set_command(0UL, start >> 16UL, FTMRx_PROGRAM);
        flash_set_command(1UL, start, start >> 8UL);
        /*Small endian by default.*/
        /* Write index to specify the word0 (MSB word) to be programmed */
        flash_set_command(2UL, *src, *src >> 8UL);

        /* Write index to specify the word1 (LSB word) to be programmed */
        flash_set_command(3UL, *src >> 16UL, *src >> 24UL);
        /* preparing passing parameter to program the flash block */

        if (4UL == flashOperationInfo.blockWriteUnitSize)
        {
            /* calling flash command sequence function to execute the command */
            returnCode = flash_command_sequence(config);
        }
        else if (8UL == flashOperationInfo.blockWriteUnitSize)
        {
            src++;
            /* Write index to specify the word (MSB word) to be programmed */
            flash_set_command(4UL, *src, *src >> 8UL);
            /* Write index to specify the word (LSB word) to be programmed */
            flash_set_command(5UL, *src >> 16UL, *src >> 24UL);

            /* calling flash command sequence function to execute the command */
            returnCode = flash_command_sequence(config);
        }
        else
        {
            /*"There's nothing to do here."*/
        }
        src++;
        /* calling flash callback function if it is available */
        if (config->PFlashCallback != NULL)
        {
            config->PFlashCallback();
        }

        /* checking for the success of command execution */
        if (kStatus_FLASH_Success != returnCode)
        {
            break;
        }
        else
        {
            /* update start address for next iteration */
            start += flashOperationInfo.blockWriteUnitSize;

            /* update lengthInBytes for next iteration */
            lengthInBytes -= flashOperationInfo.blockWriteUnitSize;
        }
    }

