Masmiseim36/nxpSDK/devices/MKE04Z1284/drivers/fsl_flash.c
    flash_cache_clear(config);

    return (returnCode);
}

/*!
 * brief Programs Program Once Field through parameters.
 *
 * This function programs the Program Once Field with the desired data for a
 * given
 * flash area as determined by the index and length.
 *
 * param config A pointer to the storage for the driver runtime state.
 * param index The index indicating which area of the Program Once Field to be
 * programmed.
 * param src A pointer to the source buffer of data that is to be programmed
 *            into the Program Once Field.
 * param lengthInBytes The length, given in bytes (not words or long-words),
 *                      to be programmed. Must be word-aligned.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_ExecuteInRamFunctionNotReady Execute-in-RAM function is
 * not available.
 * retval #kStatus_FLASH_AccessError Invalid instruction codes and out-of bounds
 * addresses.
 * retval #kStatus_FLASH_ProtectionViolation The program/erase operation is
 * requested to execute on protected areas.
 * retval #kStatus_FLASH_CommandFailure Run-time error during the command
 * execution.
 */
status_t FLASH_ProgramOnce(flash_config_t *config, uint32_t index, uint32_t *src, uint32_t lengthInBytes)
{
    status_t returnCode;

    if ((config == NULL) || (src == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }

    /* pass paramters to FTMRx */
    FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

    /* Write index to specify the command code to be loaded. */
    flash_set_command(0UL, 0UL, FTMRx_PROGRAM_ONCE);
    flash_set_command(1UL, index, index >> 8UL);

    /* Write index to specify the word0 (MSB word) to be programmed. */
    flash_set_command(2UL, *src, *src >> 8UL);

    /* Write index to specify the word1 (LSB word) to be programmed. */
    flash_set_command(3UL, *src >> 16UL, *src >> 24UL);

#if FLASH_PROGRAM_ONCE_IS_8BYTES_UNIT_SUPPORT

    /* Write index to specify the word2 (MSB word) to be programmed. */
    flash_set_command(4UL, *(src + 1UL), *(src + 1UL) >> 8UL);

    /* Write index to specify the word3 (LSB word) to be programmed. */
    flash_set_command(5UL, *(src + 1UL) >> 16UL, *(src + 1UL) >> 24UL);
#endif
    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    /* calling flash command sequence function to execute the command */
    returnCode = flash_command_sequence(config);

    flash_cache_clear(config);

    return returnCode;
}

#if FLASH_SSD_IS_EEPROM_ENABLED
status_t FLASH_EepromWrite(flash_config_t *config, uint32_t start, uint8_t *src, uint32_t lengthInBytes)
{
    status_t returnCode;
    uint32_t i;
    if ((config == NULL) || (src == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }
    if ((lengthInBytes > 4UL) || (0UL == lengthInBytes))
    {
        return kStatus_FLASH_InvalidArgument;
    }

    /* Check the supplied address range. */
    /* Validates the range of the given address */
    if ((start < config->EEpromBlockBase) ||
        ((start + lengthInBytes) > (config->EEpromBlockBase + config->EEpromTotalSize)))
    {
        return kStatus_FLASH_AddressError;
    }

    returnCode = kStatus_FLASH_Success;

    flash_cache_clear_process(config, kFLASH_CacheClearProcessPre);

    while (lengthInBytes > 3UL)
    {
        /* pass paramters to FTMRx */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

        /* Write index to specify the command code to be loaded */
        flash_set_command(0UL, start >> 16UL, FTMRx_PROGRAM_EEPROM);
        flash_set_command(1UL, start, start >> 8UL);

        /* Write index to specify the byte (MSB word) to be programmed */
        for (i = 0UL; i < lengthInBytes; i++)
        {
            flash_set_command(0x02UL + i, *src++, 0UL);
        }

        /* calling flash command sequence function to execute the command */
        returnCode = flash_command_sequence(config);

        /* calling flash callback function if it is available */
        if (config->PFlashCallback != NULL)
        {
            config->PFlashCallback();
        }

        /* checking for the success of command execution */
        if (returnCode != kStatus_FLASH_Success)
        {
            break;
        }
        else
        {
            /* update start address for next iteration */
            start += 4U;
            src += 4U;
            /* update lengthInBytes for next iteration */
            lengthInBytes -= 4UL;
        }
    }
    if ((lengthInBytes > 0UL) && (kStatus_FLASH_Success == returnCode))
    {
        /* pass paramters to FTMRx */
        FTMRx->FSTAT = FTMRx_FSTAT_ACCERR_MASK | FTMRx_FSTAT_FPVIOL_MASK;

        /* Write index to specify the command code to be loaded */
        flash_set_command(0UL, start >> 16UL, FTMRx_PROGRAM_EEPROM);
        flash_set_command(1UL, start, start >> 8UL);

        /* Write index to specify the byte (MSB word) to be programmed */
        for (i = 0UL; i < lengthInBytes; i++)
        {
            flash_set_command(0x02UL + i, *src++, 0UL);
        }
        /* calling flash command sequence function to execute the command */
        returnCode = flash_command_sequence(config);
    }
    flash_cache_clear(config);

    return (returnCode);
}
#endif /* FLASH_SSD_IS_EEPROM_ENABLED */

/*!
 * brief Reads the Program Once Field through parameters.
 *
 * This function reads the read once feild with given index and length.
 *
 * param config A pointer to the storage for the driver runtime state.
 * param index The index indicating the area of program once field to be read.
 * param dst A pointer to the destination buffer of data that is used to store
 *        data to be read.
 * param lengthInBytes The length, given in bytes (not words or long-words),
 *        to be programmed. Must be word-aligned.
 *
 * retval #kStatus_FLASH_Success API was executed successfully.
 * retval #kStatus_FLASH_InvalidArgument An invalid argument is provided.
 * retval #kStatus_FLASH_ExecuteInRamFunctionNotReady Execute-in-RAM function is
 * not available.
 * retval #kStatus_FLASH_AccessError Invalid instruction codes and out-of bounds
 * addresses.
 * retval #kStatus_FLASH_ProtectionViolation The program/erase operation is
 * requested to execute on protected areas.
 * retval #kStatus_FLASH_CommandFailure Run-time error during the command
 * execution.
 */
status_t FLASH_ReadOnce(flash_config_t *config, uint32_t index, uint32_t *dst, uint32_t lengthInBytes)
{
    uint32_t fccobloValue, fccobhiValue;
    status_t returnCode;

    if ((config == NULL) || (dst == NULL))
    {
        return kStatus_FLASH_InvalidArgument;
    }

